using python split() function -- convert address, date, time. (Create more variable)

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel(r"C:\Users\Bharti\Downloads\TASK_clean data.xlsx")

In [4]:
df

                         ADDR         DT NAME      TIME
0    Pune, Maharashtra, India 2012-04-03  XYZ  05:23:12
1  Mumbai, Maharashtra, India 2012-04-02  PQR  03:43:43

In [5]:
df[['City', 'State', 'Country']] = df['ADDR'].str.split(', ', expand=True)

In [6]:
df

,ADDR,DT,NAME,TIME,City,State,Country
0,"Pune, Maharashtra, India",2012-04-03,XYZ,05:23:12,Pune,Maharashtra,India
1,"Mumbai, Maharashtra, India",2012-04-02,PQR,03:43:43,Mumbai,Maharashtra,India

In [7]:
df[['Year', 'Month', 'Day']] = df['DT'].astype(str).str.split('-', expand=True)

In [8]:
df

,ADDR,DT,NAME,TIME,City,State,Country,Year,Month,Day
0,"Pune, Maharashtra, India",2012-04-03,XYZ,05:23:12,Pune,Maharashtra,India,2012,04,03
1,"Mumbai, Maharashtra, India",2012-04-02,PQR,03:43:43,Mumbai,Maharashtra,India,2012,04,02

In [9]:
df[['Hour', 'Minute','Second']] = df['TIME'].astype(str).str.split(':', expand=True)

In [10]:
df

,ADDR,DT,NAME,TIME,City,State,Country,Year,Month,Day,Hour,Minute,Second
0,"Pune, Maharashtra, India",2012-04-03,XYZ,05:23:12,Pune,Maharashtra,India,2012,04,03,05,23,12
1,"Mumbai, Maharashtra, India",2012-04-02,PQR,03:43:43,Mumbai,Maharashtra,India,2012,04,02,03,43,43